{"backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "tanh", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "dense_3", "kernel_constraint": null, "use_bias": true, "units": 128, "kernel_regularizer": null, "batch_input_shape": [null, 100000]}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "kernel_constraint": null, "use_bias": true, "units": 11, "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.5", "class_name": "Sequential"}